// "id": 3,
// "room_type": {
//   "id": 1,
//   "slug": "double",
//   "number_room": 2,
//   "sleeping_places": 2,
//   "title": "Стандартный двухместный",
//   "description": "",
//   "created_at": "2024-06-24T10:22:38.000000Z"
// },
// "title": "Проживание в 1-м корпусе с 21 июня по 10 августа +завтрак + ужин",
// "description": "двухместный",
// "default_price": "30000.00",
// "default_quantity": 2,
// "price": null,
// "tariff_id": null,
// "square": 20,
// "smoking": 0,
// "room_settlement": {
//   "id": 3,
//   "room_id": 3,
//   "fine": "10000.00",
//   "check_in": "2024-06-24T09:00:00.943Z",
//   "check_out": "2024-06-24T07:00:00.591Z",
//   "cancellation": {
//     "id": 3,
//     "time": "7 дней"
//   }
// },
// "gallery_images": [
//   {
//     "id": 19,
//     "name": "202405271253066538a528931d.jpg",
//     "path": "https://qazeli-new-back-dev.crocos.kz/storage/uploads/2763236119.jpg",
//     "size": 41688,
//     "hash": "14e39aaa4455372dd8c5f4d181b4221833ceb37c",
//     "created_at": "2024-06-24T12:13:12.000000Z"
//   }
// ],
// "comfort_rooms": [
//   {
//     "id": 1,
//     "comfort_room_type_id": 1,
//     "title": "Ванная комната",
//     "created_at": "2024-06-24T10:22:39.000000Z"
//   },
//   {
//     "id": 2,
//     "comfort_room_type_id": 1,
//     "title": "Туалет",
//     "created_at": "2024-06-24T10:22:39.000000Z"
//   },
//   {
//     "id": 9,
//     "comfort_room_type_id": 5,
//     "title": "WIFI",
//     "created_at": "2024-06-24T10:22:39.000000Z"
//   },
//   {
//     "id": 10,
//     "comfort_room_type_id": 6,
//     "title": "Кондиционер",
//     "created_at": "2024-06-24T10:22:39.000000Z"
//   }
// ],
// "food_types": [
//   {
//     "id": 3,
//     "slug": "two-time",
//     "title": "Двухразовое питание",
//     "created_at": "2024-06-24T10:22:38.000000Z"
//   }
// ],
// "best_tariff": null,
// "min_booking_period": 0,
// "roomTariffs": [
//   {
//     "id": 3,
//     "room_id": 3,
//     "tariff_id": 3,
//     "user_id": 6,
//     "status": "active",
//     "created_at": "2024-06-24T12:14:03.000000Z",
//     "updated_at": "2024-06-24T12:14:03.000000Z",
//     "deleted_at": null,
//     "prices": [
//       {
//         "id": 5,
//         "room_tariff_id": 3,
//         "price": "15000.00",
//         "from_at": "2025-12-02",
//         "until_at": "2025-12-06",
//         "created_at": "2024-06-26T05:17:55.000000Z",
//         "updated_at": "2024-06-26T05:17:55.000000Z",
//         "deleted_at": null
//       },
//       {
//         "id": 6,
//         "room_tariff_id": 3,
//         "price": "5.00",
//         "from_at": "2024-06-27",
//         "until_at": "2024-06-30",
//         "created_at": "2024-06-27T07:22:20.000000Z",
//         "updated_at": "2024-06-27T07:22:20.000000Z",
//         "deleted_at": null
//       },
//       {
//         "id": 7,
//         "room_tariff_id": 3,
//         "price": "100.00",
//         "from_at": "2024-07-01",
//         "until_at": "2024-07-03",
//         "created_at": "2024-06-27T07:29:11.000000Z",
//         "updated_at": "2024-06-27T07:29:11.000000Z",
//         "deleted_at": null
//       },
//       {
//         "id": 8,
//         "room_tariff_id": 3,
//         "price": "5.00",
//         "from_at": "2024-07-01",
//         "until_at": "2024-07-06",
//         "created_at": "2024-06-27T07:32:41.000000Z",
//         "updated_at": "2024-06-27T07:32:41.000000Z",
//         "deleted_at": null
//       }
//     ],
//     "quantities": [
//       {
//         "id": 5,
//         "room_tariff_id": 3,
//         "quantity": 20,
//         "from_at": "2025-12-02",
//         "until_at": "2025-12-06",
//         "created_at": "2024-06-26T05:17:55.000000Z",
//         "updated_at": "2024-06-26T05:17:55.000000Z",
//         "deleted_at": null
//       },
//       {
//         "id": 6,
//         "room_tariff_id": 3,
//         "quantity": 5,
//         "from_at": "2024-06-27",
//         "until_at": "2024-06-30",
//         "created_at": "2024-06-27T07:22:20.000000Z",
//         "updated_at": "2024-06-27T07:22:20.000000Z",
//         "deleted_at": null
//       },
//       {
//         "id": 7,
//         "room_tariff_id": 3,
//         "quantity": 10,
//         "from_at": "2024-07-01",
//         "until_at": "2024-07-03",
//         "created_at": "2024-06-27T07:29:11.000000Z",
//         "updated_at": "2024-06-27T07:29:11.000000Z",
//         "deleted_at": null
//       },
//       {
//         "id": 8,
//         "room_tariff_id": 3,
//         "quantity": 10,
//         "from_at": "2024-07-01",
//         "until_at": "2024-07-06",
//         "created_at": "2024-06-27T07:32:41.000000Z",
//         "updated_at": "2024-06-27T07:32:41.000000Z",
//         "deleted_at": null
//       }
//     ],
//     "statuses": [
//       {
//         "id": 3,
//         "room_tariff_id": 3,
//         "status": "active",
//         "from_at": "2024-06-27",
//         "until_at": "2024-06-30",
//         "created_at": "2024-06-27T07:22:20.000000Z",
//         "updated_at": "2024-06-27T07:22:20.000000Z",
//         "deleted_at": null
//       },
//       {
//         "id": 4,
//         "room_tariff_id": 3,
//         "status": "active",
//         "from_at": "2024-07-01",
//         "until_at": "2024-07-03",
//         "created_at": "2024-06-27T07:29:11.000000Z",
//         "updated_at": "2024-06-27T07:29:11.000000Z",
//         "deleted_at": null
//       },
//       {
//         "id": 5,
//         "room_tariff_id": 3,
//         "status": "active",
//         "from_at": "2024-07-01",
//         "until_at": "2024-07-06",
//         "created_at": "2024-06-27T07:32:41.000000Z",
//         "updated_at": "2024-06-27T07:32:41.000000Z",
//         "deleted_at": null
//       }
//     ],
//     "tariff": {
//       "id": 3,
//       "tariff_id": null,
//       "placement_id": 3,
//       "percent": "0.00",
//       "created_at": "2024-06-24T12:14:03.000000Z",
//       "updated_at": "2024-06-27T07:08:17.000000Z",
//       "deleted_at": null,
//       "title": "Стандарт",
//       "translations": [
//         {
//           "id": 7,
//           "tariff_id": 3,
//           "locale": "ru",
//           "title": "Стандарт",
//           "created_at": "2024-06-24T12:14:03.000000Z",
//           "updated_at": "2024-06-27T07:08:17.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 8,
//           "tariff_id": 3,
//           "locale": "en",
//           "title": "Стандарт",
//           "created_at": "2024-06-24T12:14:03.000000Z",
//           "updated_at": "2024-06-27T07:08:17.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 9,
//           "tariff_id": 3,
//           "locale": "kz",
//           "title": "Стандарт",
//           "created_at": "2024-06-24T12:14:03.000000Z",
//           "updated_at": "2024-06-27T07:08:17.000000Z",
//           "deleted_at": null
//         }
//       ],
//       "parent": null,
//       "room_tariffs": [
//         {
//           "id": 3,
//           "room_id": 3,
//           "tariff_id": 3,
//           "user_id": 6,
//           "status": "active",
//           "created_at": "2024-06-24T12:14:03.000000Z",
//           "updated_at": "2024-06-24T12:14:03.000000Z",
//           "deleted_at": null,
//           "prices": [
//             {
//               "id": 5,
//               "room_tariff_id": 3,
//               "price": "15000.00",
//               "from_at": "2025-12-02",
//               "until_at": "2025-12-06",
//               "created_at": "2024-06-26T05:17:55.000000Z",
//               "updated_at": "2024-06-26T05:17:55.000000Z",
//               "deleted_at": null
//             },
//             {
//               "id": 6,
//               "room_tariff_id": 3,
//               "price": "5.00",
//               "from_at": "2024-06-27",
//               "until_at": "2024-06-30",
//               "created_at": "2024-06-27T07:22:20.000000Z",
//               "updated_at": "2024-06-27T07:22:20.000000Z",
//               "deleted_at": null
//             },
//             {
//               "id": 7,
//               "room_tariff_id": 3,
//               "price": "100.00",
//               "from_at": "2024-07-01",
//               "until_at": "2024-07-03",
//               "created_at": "2024-06-27T07:29:11.000000Z",
//               "updated_at": "2024-06-27T07:29:11.000000Z",
//               "deleted_at": null
//             },
//             {
//               "id": 8,
//               "room_tariff_id": 3,
//               "price": "5.00",
//               "from_at": "2024-07-01",
//               "until_at": "2024-07-06",
//               "created_at": "2024-06-27T07:32:41.000000Z",
//               "updated_at": "2024-06-27T07:32:41.000000Z",
//               "deleted_at": null
//             }
//           ],
//           "quantities": [
//             {
//               "id": 5,
//               "room_tariff_id": 3,
//               "quantity": 20,
//               "from_at": "2025-12-02",
//               "until_at": "2025-12-06",
//               "created_at": "2024-06-26T05:17:55.000000Z",
//               "updated_at": "2024-06-26T05:17:55.000000Z",
//               "deleted_at": null
//             },
//             {
//               "id": 6,
//               "room_tariff_id": 3,
//               "quantity": 5,
//               "from_at": "2024-06-27",
//               "until_at": "2024-06-30",
//               "created_at": "2024-06-27T07:22:20.000000Z",
//               "updated_at": "2024-06-27T07:22:20.000000Z",
//               "deleted_at": null
//             },
//             {
//               "id": 7,
//               "room_tariff_id": 3,
//               "quantity": 10,
//               "from_at": "2024-07-01",
//               "until_at": "2024-07-03",
//               "created_at": "2024-06-27T07:29:11.000000Z",
//               "updated_at": "2024-06-27T07:29:11.000000Z",
//               "deleted_at": null
//             },
//             {
//               "id": 8,
//               "room_tariff_id": 3,
//               "quantity": 10,
//               "from_at": "2024-07-01",
//               "until_at": "2024-07-06",
//               "created_at": "2024-06-27T07:32:41.000000Z",
//               "updated_at": "2024-06-27T07:32:41.000000Z",
//               "deleted_at": null
//             }
//           ],
//           "statuses": [
//             {
//               "id": 3,
//               "room_tariff_id": 3,
//               "status": "active",
//               "from_at": "2024-06-27",
//               "until_at": "2024-06-30",
//               "created_at": "2024-06-27T07:22:20.000000Z",
//               "updated_at": "2024-06-27T07:22:20.000000Z",
//               "deleted_at": null
//             },
//             {
//               "id": 4,
//               "room_tariff_id": 3,
//               "status": "active",
//               "from_at": "2024-07-01",
//               "until_at": "2024-07-03",
//               "created_at": "2024-06-27T07:29:11.000000Z",
//               "updated_at": "2024-06-27T07:29:11.000000Z",
//               "deleted_at": null
//             },
//             {
//               "id": 5,
//               "room_tariff_id": 3,
//               "status": "active",
//               "from_at": "2024-07-01",
//               "until_at": "2024-07-06",
//               "created_at": "2024-06-27T07:32:41.000000Z",
//               "updated_at": "2024-06-27T07:32:41.000000Z",
//               "deleted_at": null
//             }
//           ]
//         }
//       ],
//       "children": []
//     }
//   }
// ],
// "roomTariffsItems": [
//   {
//     "id": 1,
//     "room_tariff_id": 1,
//     "tariff_title": "Гибкий",
//     "price": 0.9,
//     "room_id": 1
//   },
//   {
//     "id": 4,
//     "room_tariff_id": 4,
//     "tariff_title": "dsad",
//     "price": 1.15,
//     "room_id": 1
//   },
//   {
//     "id": 2,
//     "room_tariff_id": 2,
//     "tariff_title": "Стандартный",
//     "price": 12,
//     "room_id": 2
//   },
//   {
//     "id": 3,
//     "room_tariff_id": 3,
//     "tariff_title": "Стандарт",
//     "price": 5,
//     "room_id": 3
//   }
// ],
// "placement": {
//   "id": 3,
//   "email": "pavlintour@mail.ru",
//   "phone": "+7 (702) 636 15 42",
//   "placement_type_id": 1,
//   "user_id": 6,
//   "city_id": 89,
//   "main_image_id": 30,
//   "rating": 3,
//   "status": "active",
//   "freeze": 0,
//   "lat": 53.08,
//   "lon": 70.31,
//   "created_at": "2024-06-24T12:02:23.000000Z",
//   "updated_at": "2024-06-24T13:47:52.000000Z",
//   "deleted_at": null,
//   "title": "Cabana village Borovoe",
//   "address": "Акмолинская область, Бурабайский р-он, пос. Бурабай, ул. Мерей, 20а",
//   "description": "<h4><strong>ГОСТЕВОЙ КОМПЛЕКС CABANA VILLAGE</strong></h4><ul><li><p>Гостевой дом Cabana Village расположен в частном секторе живописного посёлка Бурабай. Гости могут насладиться всей инфраструктурой курорта, сделав всего несколько шагов. С 1 июня 2023 года посетителям предоставляется возможность посетить территорию отеля Wyndham Garden Burabay с помощью браслетов Cabana Мillage, где доступны различные удобства за дополнительную плату: SPA, рестораны, кафе, ночной клуб и пляж, а также бассейн. Но, несмотря на это, в гостевом доме всегда весело и уютно.</p></li><li><p>Расстояние между отелями составляет всего 15 минут пешком, что обеспечивает гостям удобство и лёгкий доступ ко всем развлечениям курорта.</p></li><li><p>Проживание включает в себя два двухэтажных гостевых дома со стандартными удобствами (всего 8 номеров).&nbsp;</p></li><li><p>Каждый номер оснащён кроватями, тумбочками, прикроватными ковриками, вешалками, розетками, комодом, настольными светильниками, зеркалом, феном,&nbsp;душем, унитазом и умывальником,&nbsp;а также для удобства гостей&nbsp;имеется прайс-меню.</p></li><li><p>При заезде каждому гостю выдаются одноразовые тапочки (за исключением детей до 3 лет), а также по 2 полотенца на человека.</p></li><li><p>Номера представлены следующим образом:</p><ul><li><p>2 трёхместных номера оснащены тремя раздельными кроватями;</p></li><li><p>3 трёхместных номера оснащены двуспальной и односпальной кроватью;</p></li><li><p>4 четырехместных номера оснащены двуспальной и двумя односпальными кроватями;</p></li><li><p>5-местный семейный номер представляет собой двухкомнатный номер с одной двуспальной кроватью и тремя односпальными кроватями. В этом номере также имеется отдельный санузел, душ, холодильник, прикроватные коврики, фен, а такде отдельная зона со столиком и лавочками.</p></li></ul><p></p></li><li><p>Питание Half board (полупансион):</p><ul><li><p>Завтрак (09:00-11:00):</p><ul><li><p>2 вида завтрака на выбор: английский или славянский;</p></li><li><p>чай в пакетиках или турецкий, либо варенный в турке кофе.</p></li></ul></li><li><p>Ужин (19:00-21:00):</p><ul><li><p>горячее блюдо;</p></li><li><p>салат;</p></li><li><p>напитки на выбор: чай или три вида прохладительных коктейлей;</p></li><li><p>мороженое с сиропами (для каждого гостя по 100 грамм).</p></li></ul></li></ul><p></p></li><li><p>&nbsp;Дополнительные услуги:</p><ul><li><p>мангальная зона;</p></li><li><p>детская площадка с батутом и домиком;</p></li><li><p>Wi-Fi на всей территории;</p></li><li><p>Soft-Bar за отдельную плату, включающий прохладительные напитки, коктейли, лимонады, кофейную и чайную карты, смузи и мороженое;</p></li><li><p>сауна до 5 человек за отдельную плату, с комнатой отдыха, тропической зоной и тропическим душем, шезлонгами и столиком под открытым небом. При посещении сауны выдаются банные принадлежности (полотенца);</p></li><li><p>автостоянка.&nbsp;</p></li></ul><p></p></li><li><p>На территории также имеется кафе, где вы сможете оформить заказ по кухне и бару.&nbsp;</p></li><li><p>Средний чек на человека&nbsp;— 3 500 тг.&nbsp;</p></li><li><p>Расчётный час&nbsp;— заезд&nbsp;— 14:00, выезд&nbsp;— 12:00.<br>&nbsp;<br>Приезжайте и не упустите возможность круто провести время!&nbsp;</p></li></ul>",
//   "translations": [
//     {
//       "id": 8,
//       "placement_id": 3,
//       "locale": "en",
//       "title": "Cabana village Borovoe",
//       "description": "<h4><strong>ГОСТЕВОЙ КОМПЛЕКС CABANA VILLAGE</strong></h4><ul><li><p>Гостевой дом Cabana Village расположен в частном секторе живописного посёлка Бурабай. Гости могут насладиться всей инфраструктурой курорта, сделав всего несколько шагов. С 1 июня 2023 года посетителям предоставляется возможность посетить территорию отеля Wyndham Garden Burabay с помощью браслетов Cabana Мillage, где доступны различные удобства за дополнительную плату: SPA, рестораны, кафе, ночной клуб и пляж, а также бассейн. Но, несмотря на это, в гостевом доме всегда весело и уютно.</p></li><li><p>Расстояние между отелями составляет всего 15 минут пешком, что обеспечивает гостям удобство и лёгкий доступ ко всем развлечениям курорта.</p></li><li><p>Проживание включает в себя два двухэтажных гостевых дома со стандартными удобствами (всего 8 номеров).&nbsp;</p></li><li><p>Каждый номер оснащён кроватями, тумбочками, прикроватными ковриками, вешалками, розетками, комодом, настольными светильниками, зеркалом, феном,&nbsp;душем, унитазом и умывальником,&nbsp;а также для удобства гостей&nbsp;имеется прайс-меню.</p></li><li><p>При заезде каждому гостю выдаются одноразовые тапочки (за исключением детей до 3 лет), а также по 2 полотенца на человека.</p></li><li><p>Номера представлены следующим образом:</p><ul><li><p>2 трёхместных номера оснащены тремя раздельными кроватями;</p></li><li><p>3 трёхместных номера оснащены двуспальной и односпальной кроватью;</p></li><li><p>4 четырехместных номера оснащены двуспальной и двумя односпальными кроватями;</p></li><li><p>5-местный семейный номер представляет собой двухкомнатный номер с одной двуспальной кроватью и тремя односпальными кроватями. В этом номере также имеется отдельный санузел, душ, холодильник, прикроватные коврики, фен, а такде отдельная зона со столиком и лавочками.</p></li></ul><p></p></li><li><p>Питание Half board (полупансион):</p><ul><li><p>Завтрак (09:00-11:00):</p><ul><li><p>2 вида завтрака на выбор: английский или славянский;</p></li><li><p>чай в пакетиках или турецкий, либо варенный в турке кофе.</p></li></ul></li><li><p>Ужин (19:00-21:00):</p><ul><li><p>горячее блюдо;</p></li><li><p>салат;</p></li><li><p>напитки на выбор: чай или три вида прохладительных коктейлей;</p></li><li><p>мороженое с сиропами (для каждого гостя по 100 грамм).</p></li></ul></li></ul><p></p></li><li><p>&nbsp;Дополнительные услуги:</p><ul><li><p>мангальная зона;</p></li><li><p>детская площадка с батутом и домиком;</p></li><li><p>Wi-Fi на всей территории;</p></li><li><p>Soft-Bar за отдельную плату, включающий прохладительные напитки, коктейли, лимонады, кофейную и чайную карты, смузи и мороженое;</p></li><li><p>сауна до 5 человек за отдельную плату, с комнатой отдыха, тропической зоной и тропическим душем, шезлонгами и столиком под открытым небом. При посещении сауны выдаются банные принадлежности (полотенца);</p></li><li><p>автостоянка.&nbsp;</p></li></ul><p></p></li><li><p>На территории также имеется кафе, где вы сможете оформить заказ по кухне и бару.&nbsp;</p></li><li><p>Средний чек на человека&nbsp;— 3 500 тг.&nbsp;</p></li><li><p>Расчётный час&nbsp;— заезд&nbsp;— 14:00, выезд&nbsp;— 12:00.<br>&nbsp;<br>Приезжайте и не упустите возможность круто провести время!&nbsp;</p></li></ul>",
//       "address": "Акмолинская область, Бурабайский р-он, пос. Бурабай, ул. Мерей, 20а",
//       "text_near": null,
//       "text_restaurant": null,
//       "text_get_there": null,
//       "created_at": "2024-06-24T12:02:23.000000Z",
//       "updated_at": "2024-06-24T12:02:23.000000Z",
//       "deleted_at": null
//     },
//     {
//       "id": 9,
//       "placement_id": 3,
//       "locale": "kz",
//       "title": "Cabana village Borovoe",
//       "description": "<h4><strong>ГОСТЕВОЙ КОМПЛЕКС CABANA VILLAGE</strong></h4><ul><li><p><u>Гостевой дом Cabana Village</u> расположен в частном секторе живописного посёлка Бурабай. Гости могут насладиться всей инфраструктурой курорта, сделав всего несколько шагов. </p></li><li><p><u>С 1 июня 2023</u> года посетителям предоставляется возможность посетить территорию отеля Wyndham Garden Burabay с помощью браслетов Cabana Мillage, где доступны различные удобства за дополнительную плату: SPA, рестораны, кафе, ночной клуб и пляж, а также бассейн. Но, несмотря на это, в гостевом доме всегда весело и уютно.</p></li><li><p><u>Расстояние</u> между отелями составляет всего 15 минут пешком, что обеспечивает гостям удобство и лёгкий доступ ко всем развлечениям курорта.</p></li><li><p><u>Проживание включает</u> в себя два двухэтажных гостевых дома со стандартными удобствами (всего 8 номеров).&nbsp;</p></li><li><p>Каждый номер оснащён кроватями, тумбочками, прикроватными ковриками, вешалками, розетками, комодом, настольными светильниками, зеркалом, феном,&nbsp;душем, унитазом и умывальником,&nbsp;а также для удобства гостей&nbsp;имеется прайс-меню.</p></li><li><p><u>При заезде каждому</u> гостю выдаются одноразовые тапочки (за исключением детей до 3 лет), а также по 2 полотенца на человека.</p></li><li><p><u>Номера представлены</u> следующим образом:</p><ul><li><p>2 трёхместных номера оснащены тремя раздельными кроватями;</p></li><li><p>3 трёхместных номера оснащены двуспальной и односпальной кроватью;</p></li><li><p>4 четырехместных номера оснащены двуспальной и двумя односпальными кроватями;</p></li><li><p>5-местный семейный номер представляет собой двухкомнатный номер с одной двуспальной кроватью и тремя односпальными кроватями. В этом номере также имеется отдельный санузел, душ, холодильник, прикроватные коврики, фен, а такде отдельная зона со столиком и лавочками.</p></li></ul></li><li><p><u>Питание Half board (полупансион):</u></p><ul><li><p>Завтрак (09:00-11:00):</p><ul><li><p>2 вида завтрака на выбор: английский или славянский;</p></li><li><p>чай в пакетиках или турецкий, либо варенный в турке кофе.</p></li></ul></li><li><p>Ужин (19:00-21:00):</p><ul><li><p>горячее блюдо;</p></li><li><p>салат;</p></li><li><p>напитки на выбор: чай или три вида прохладительных коктейлей;</p></li><li><p>мороженое с сиропами (для каждого гостя по 100 грамм).</p></li></ul></li></ul></li><li><p>&nbsp;<u>Дополнительные услуги</u>:</p><ul><li><p>мангальная зона;</p></li><li><p>детская площадка с батутом и домиком;</p></li><li><p>Wi-Fi на всей территории;</p></li><li><p>Soft-Bar за отдельную плату, включающий прохладительные напитки, коктейли, лимонады, кофейную и чайную карты, смузи и мороженое;</p></li><li><p>сауна до 5 человек за отдельную плату, с комнатой отдыха, тропической зоной и тропическим душем, шезлонгами и столиком под открытым небом. При посещении сауны выдаются банные принадлежности (полотенца);</p></li><li><p>автостоянка.&nbsp;</p></li></ul></li><li><p><u>На территории </u>также имеется кафе, где вы сможете оформить заказ по кухне и бару.&nbsp;</p></li><li><p>Средний чек на человека&nbsp;— 3 500 тг.&nbsp;</p></li><li><p>Расчётный час&nbsp;— заезд&nbsp;— 14:00, выезд&nbsp;— 12:00.</p></li></ul>",
//       "address": "Акмолинская область, Бурабайский р-он, пос. Бурабай, ул. Мерей, 20а",
//       "text_near": null,
//       "text_restaurant": null,
//       "text_get_there": null,
//       "created_at": "2024-06-24T12:02:23.000000Z",
//       "updated_at": "2024-06-27T06:50:16.000000Z",
//       "deleted_at": null
//     },
//     {
//       "id": 7,
//       "placement_id": 3,
//       "locale": "ru",
//       "title": "Cabana village Borovoe",
//       "description": "<h4><strong>ГОСТЕВОЙ КОМПЛЕКС CABANA VILLAGE</strong></h4><ul><li><p>Гостевой дом Cabana Village расположен в частном секторе живописного посёлка Бурабай. Гости могут насладиться всей инфраструктурой курорта, сделав всего несколько шагов. С 1 июня 2023 года посетителям предоставляется возможность посетить территорию отеля Wyndham Garden Burabay с помощью браслетов Cabana Мillage, где доступны различные удобства за дополнительную плату: SPA, рестораны, кафе, ночной клуб и пляж, а также бассейн. Но, несмотря на это, в гостевом доме всегда весело и уютно.</p></li><li><p>Расстояние между отелями составляет всего 15 минут пешком, что обеспечивает гостям удобство и лёгкий доступ ко всем развлечениям курорта.</p></li><li><p>Проживание включает в себя два двухэтажных гостевых дома со стандартными удобствами (всего 8 номеров).&nbsp;</p></li><li><p>Каждый номер оснащён кроватями, тумбочками, прикроватными ковриками, вешалками, розетками, комодом, настольными светильниками, зеркалом, феном,&nbsp;душем, унитазом и умывальником,&nbsp;а также для удобства гостей&nbsp;имеется прайс-меню.</p></li><li><p>При заезде каждому гостю выдаются одноразовые тапочки (за исключением детей до 3 лет), а также по 2 полотенца на человека.</p></li><li><p>Номера представлены следующим образом:</p><ul><li><p>2 трёхместных номера оснащены тремя раздельными кроватями;</p></li><li><p>3 трёхместных номера оснащены двуспальной и односпальной кроватью;</p></li><li><p>4 четырехместных номера оснащены двуспальной и двумя односпальными кроватями;</p></li><li><p>5-местный семейный номер представляет собой двухкомнатный номер с одной двуспальной кроватью и тремя односпальными кроватями. В этом номере также имеется отдельный санузел, душ, холодильник, прикроватные коврики, фен, а такде отдельная зона со столиком и лавочками.</p></li></ul><p></p></li><li><p>Питание Half board (полупансион):</p><ul><li><p>Завтрак (09:00-11:00):</p><ul><li><p>2 вида завтрака на выбор: английский или славянский;</p></li><li><p>чай в пакетиках или турецкий, либо варенный в турке кофе.</p></li></ul></li><li><p>Ужин (19:00-21:00):</p><ul><li><p>горячее блюдо;</p></li><li><p>салат;</p></li><li><p>напитки на выбор: чай или три вида прохладительных коктейлей;</p></li><li><p>мороженое с сиропами (для каждого гостя по 100 грамм).</p></li></ul></li></ul><p></p></li><li><p>&nbsp;Дополнительные услуги:</p><ul><li><p>мангальная зона;</p></li><li><p>детская площадка с батутом и домиком;</p></li><li><p>Wi-Fi на всей территории;</p></li><li><p>Soft-Bar за отдельную плату, включающий прохладительные напитки, коктейли, лимонады, кофейную и чайную карты, смузи и мороженое;</p></li><li><p>сауна до 5 человек за отдельную плату, с комнатой отдыха, тропической зоной и тропическим душем, шезлонгами и столиком под открытым небом. При посещении сауны выдаются банные принадлежности (полотенца);</p></li><li><p>автостоянка.&nbsp;</p></li></ul><p></p></li><li><p>На территории также имеется кафе, где вы сможете оформить заказ по кухне и бару.&nbsp;</p></li><li><p>Средний чек на человека&nbsp;— 3 500 тг.&nbsp;</p></li><li><p>Расчётный час&nbsp;— заезд&nbsp;— 14:00, выезд&nbsp;— 12:00.<br>&nbsp;<br>Приезжайте и не упустите возможность круто провести время!&nbsp;</p></li></ul>",
//       "address": "Акмолинская область, Бурабайский р-он, пос. Бурабай, ул. Мерей, 20а",
//       "text_near": null,
//       "text_restaurant": null,
//       "text_get_there": null,
//       "created_at": "2024-06-24T12:02:23.000000Z",
//       "updated_at": "2024-06-24T12:02:23.000000Z",
//       "deleted_at": null
//     }
//   ],
//   "type": {
//     "id": 1,
//     "slug": "hotel",
//     "image_id": 1,
//     "created_at": "2024-06-24T10:22:38.000000Z",
//     "updated_at": "2024-06-24T10:22:38.000000Z",
//     "deleted_at": null,
//     "title": "Отель",
//     "translations": [
//       {
//         "id": 3,
//         "placement_type_id": 1,
//         "locale": "en",
//         "title": "Hotel",
//         "created_at": "2024-06-24T10:22:38.000000Z",
//         "updated_at": "2024-06-24T10:22:38.000000Z",
//         "deleted_at": null
//       },
//       {
//         "id": 2,
//         "placement_type_id": 1,
//         "locale": "kz",
//         "title": "Қонақ үй",
//         "created_at": "2024-06-24T10:22:38.000000Z",
//         "updated_at": "2024-06-24T10:22:38.000000Z",
//         "deleted_at": null
//       },
//       {
//         "id": 1,
//         "placement_type_id": 1,
//         "locale": "ru",
//         "title": "Отель",
//         "created_at": "2024-06-24T10:22:38.000000Z",
//         "updated_at": "2024-06-24T10:22:38.000000Z",
//         "deleted_at": null
//       }
//     ],
//     "image": {
//       "id": 1,
//       "disk": "uploads",
//       "name": "hotel.jpg",
//       "hash": "a04289e7443267772bcae8ea85711c9e19c12300",
//       "path": "placementTypesImages/2964966038.jpg",
//       "size": 444485,
//       "created_at": "2024-06-24T10:22:38.000000Z",
//       "updated_at": "2024-06-24T10:22:38.000000Z",
//       "deleted_at": null
//     }
//   },
//   "city": {
//     "id": 89,
//     "region_id": 5,
//     "created_at": "2024-06-24T10:22:38.000000Z",
//     "updated_at": "2024-06-24T10:22:38.000000Z",
//     "deleted_at": null,
//     "title": "Боровое",
//     "translations": [
//       {
//         "id": 267,
//         "city_id": 89,
//         "locale": "en",
//         "title": "Borovoe",
//         "created_at": "2024-06-24T10:22:38.000000Z",
//         "updated_at": "2024-06-24T10:22:38.000000Z",
//         "deleted_at": null
//       },
//       {
//         "id": 266,
//         "city_id": 89,
//         "locale": "kz",
//         "title": "Бурабай",
//         "created_at": "2024-06-24T10:22:38.000000Z",
//         "updated_at": "2024-06-24T10:22:38.000000Z",
//         "deleted_at": null
//       },
//       {
//         "id": 265,
//         "city_id": 89,
//         "locale": "ru",
//         "title": "Боровое",
//         "created_at": "2024-06-24T10:22:38.000000Z",
//         "updated_at": "2024-06-24T10:22:38.000000Z",
//         "deleted_at": null
//       }
//     ]
//   },
//   "main_image": {
//     "id": 30,
//     "disk": "uploads",
//     "name": "62b45c66cb698 (1).jpg",
//     "hash": "f63b00fd632005332aeb4d5c0ed067e6b23605e2",
//     "path": "uploads/3378595570.jpg",
//     "size": 266217,
//     "created_at": "2024-06-24T13:47:50.000000Z",
//     "updated_at": "2024-06-24T13:47:50.000000Z",
//     "deleted_at": null
//   },
//   "gallery_images": [
//     {
//       "id": 30,
//       "disk": "uploads",
//       "name": "62b45c66cb698 (1).jpg",
//       "hash": "f63b00fd632005332aeb4d5c0ed067e6b23605e2",
//       "path": "uploads/3378595570.jpg",
//       "size": 266217,
//       "created_at": "2024-06-24T13:47:50.000000Z",
//       "updated_at": "2024-06-24T13:47:50.000000Z",
//       "deleted_at": null,
//       "pivot": {
//         "placement_id": 3,
//         "upload_id": 30
//       }
//     },
//     {
//       "id": 31,
//       "disk": "uploads",
//       "name": "62b45c65e2eff (1).jpg",
//       "hash": "8b582b08ac75734e883af2e03900debfb70e82f9",
//       "path": "uploads/2144172390.jpg",
//       "size": 269751,
//       "created_at": "2024-06-24T13:47:50.000000Z",
//       "updated_at": "2024-06-24T13:47:50.000000Z",
//       "deleted_at": null,
//       "pivot": {
//         "placement_id": 3,
//         "upload_id": 31
//       }
//     },
//     {
//       "id": 32,
//       "disk": "uploads",
//       "name": "20240527115486654d20c0e773.jpg",
//       "hash": "ed0177b6609924b00a8a5ff9f7f90a40cb65add0",
//       "path": "uploads/2291306551.jpg",
//       "size": 72905,
//       "created_at": "2024-06-24T13:47:50.000000Z",
//       "updated_at": "2024-06-24T13:47:50.000000Z",
//       "deleted_at": null,
//       "pivot": {
//         "placement_id": 3,
//         "upload_id": 32
//       }
//     },
//     {
//       "id": 33,
//       "disk": "uploads",
//       "name": "202405271253266538a5440b7a.jpg",
//       "hash": "c80f1d97066215496209724056ff26658c678187",
//       "path": "uploads/2096453276.jpg",
//       "size": 77988,
//       "created_at": "2024-06-24T13:47:50.000000Z",
//       "updated_at": "2024-06-24T13:47:50.000000Z",
//       "deleted_at": null,
//       "pivot": {
//         "placement_id": 3,
//         "upload_id": 33
//       }
//     },
//     {
//       "id": 34,
//       "disk": "uploads",
//       "name": "62b45c72aefb4 (1).jpg",
//       "hash": "5b39fd1bd2e5793c1c069445c6344bff9fd0a1b2",
//       "path": "uploads/2919833384.jpg",
//       "size": 167982,
//       "created_at": "2024-06-24T13:47:50.000000Z",
//       "updated_at": "2024-06-24T13:47:50.000000Z",
//       "deleted_at": null,
//       "pivot": {
//         "placement_id": 3,
//         "upload_id": 34
//       }
//     }
//   ],
//   "rooms": [
//     {
//       "id": 3,
//       "placement_id": 3,
//       "room_type_id": 1,
//       "price": "30000.00",
//       "quantity": 2,
//       "min_booking_period": 0,
//       "square": 20,
//       "smoking": 0,
//       "status": "active",
//       "created_at": "2024-06-24T12:13:12.000000Z",
//       "updated_at": "2024-06-27T07:31:32.000000Z",
//       "deleted_at": null,
//       "title": "Проживание в 1-м корпусе с 21 июня по 10 августа +завтрак + ужин",
//       "description": "двухместный",
//       "translations": [
//         {
//           "id": 7,
//           "room_id": 3,
//           "locale": "ru",
//           "title": "Проживание в 1-м корпусе с 21 июня по 10 августа +завтрак + ужин",
//           "description": "двухместный",
//           "created_at": "2024-06-24T12:13:12.000000Z",
//           "updated_at": "2024-06-24T12:13:12.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 8,
//           "room_id": 3,
//           "locale": "en",
//           "title": "Проживание в 1-м корпусе с 21 июня по 10 августа +завтрак + ужин",
//           "description": "двухместный",
//           "created_at": "2024-06-24T12:13:12.000000Z",
//           "updated_at": "2024-06-24T12:13:12.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 9,
//           "room_id": 3,
//           "locale": "kz",
//           "title": "Проживание в 1-м корпусе с 21 июня по 10 августа +завтрак + ужин",
//           "description": "двухместный",
//           "created_at": "2024-06-24T12:13:12.000000Z",
//           "updated_at": "2024-06-24T12:13:12.000000Z",
//           "deleted_at": null
//         }
//       ]
//     },
//     {
//       "id": 7,
//       "placement_id": 3,
//       "room_type_id": 2,
//       "price": "15000.00",
//       "quantity": 1,
//       "min_booking_period": 0,
//       "square": 15,
//       "smoking": 0,
//       "status": "active",
//       "created_at": "2024-06-27T07:25:31.000000Z",
//       "updated_at": "2024-06-27T07:25:31.000000Z",
//       "deleted_at": null,
//       "title": "Стандартный single",
//       "description": "ре",
//       "translations": [
//         {
//           "id": 19,
//           "room_id": 7,
//           "locale": "ru",
//           "title": "Стандартный single",
//           "description": "ре",
//           "created_at": "2024-06-27T07:25:31.000000Z",
//           "updated_at": "2024-06-27T07:25:31.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 20,
//           "room_id": 7,
//           "locale": "en",
//           "title": "Стандартный single",
//           "description": "ре",
//           "created_at": "2024-06-27T07:25:31.000000Z",
//           "updated_at": "2024-06-27T07:25:31.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 21,
//           "room_id": 7,
//           "locale": "kz",
//           "title": "Стандарт",
//           "description": "ре",
//           "created_at": "2024-06-27T07:25:31.000000Z",
//           "updated_at": "2024-06-27T07:25:31.000000Z",
//           "deleted_at": null
//         }
//       ]
//     },
//     {
//       "id": 8,
//       "placement_id": 3,
//       "room_type_id": 8,
//       "price": "45000.00",
//       "quantity": 1,
//       "min_booking_period": 0,
//       "square": 40,
//       "smoking": 0,
//       "status": "active",
//       "created_at": "2024-06-27T07:28:22.000000Z",
//       "updated_at": "2024-06-27T07:31:49.000000Z",
//       "deleted_at": null,
//       "title": "Стандартный 3",
//       "description": "Стандарт",
//       "translations": [
//         {
//           "id": 22,
//           "room_id": 8,
//           "locale": "ru",
//           "title": "Стандартный 3",
//           "description": "Стандарт",
//           "created_at": "2024-06-27T07:28:22.000000Z",
//           "updated_at": "2024-06-27T07:28:22.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 23,
//           "room_id": 8,
//           "locale": "en",
//           "title": "Стандартный 3",
//           "description": "Стандарт",
//           "created_at": "2024-06-27T07:28:22.000000Z",
//           "updated_at": "2024-06-27T07:28:22.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 24,
//           "room_id": 8,
//           "locale": "kz",
//           "title": "Стандартный 3",
//           "description": "Стандарт",
//           "created_at": "2024-06-27T07:28:22.000000Z",
//           "updated_at": "2024-06-27T07:28:22.000000Z",
//           "deleted_at": null
//         }
//       ]
//     },
//     {
//       "id": 9,
//       "placement_id": 3,
//       "room_type_id": 9,
//       "price": "68000.00",
//       "quantity": 1,
//       "min_booking_period": 0,
//       "square": 25,
//       "smoking": 0,
//       "status": "active",
//       "created_at": "2024-06-27T09:12:33.000000Z",
//       "updated_at": "2024-06-27T09:12:33.000000Z",
//       "deleted_at": null,
//       "title": "четерехместный",
//       "description": "4 кровати",
//       "translations": [
//         {
//           "id": 25,
//           "room_id": 9,
//           "locale": "ru",
//           "title": "четерехместный",
//           "description": "4 кровати",
//           "created_at": "2024-06-27T09:12:33.000000Z",
//           "updated_at": "2024-06-27T09:12:33.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 26,
//           "room_id": 9,
//           "locale": "en",
//           "title": "четерехместный",
//           "description": "4 кровати",
//           "created_at": "2024-06-27T09:12:33.000000Z",
//           "updated_at": "2024-06-27T09:12:33.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 27,
//           "room_id": 9,
//           "locale": "kz",
//           "title": "четерехместный",
//           "description": "4 кровати",
//           "created_at": "2024-06-27T09:12:33.000000Z",
//           "updated_at": "2024-06-27T09:12:33.000000Z",
//           "deleted_at": null
//         }
//       ]
//     }
//   ],
//   "service_types": [
//     {
//       "id": 1,
//       "slug": "wi-fi",
//       "created_at": "2024-06-24T10:22:38.000000Z",
//       "updated_at": "2024-06-24T10:22:38.000000Z",
//       "deleted_at": null,
//       "title": "Бесплатный Wi-Fi",
//       "pivot": {
//         "placement_id": 3,
//         "service_type_id": 1
//       },
//       "translations": [
//         {
//           "id": 1,
//           "service_type_id": 1,
//           "locale": "ru",
//           "title": "Бесплатный Wi-Fi",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 2,
//           "service_type_id": 1,
//           "locale": "kz",
//           "title": "Бесплатный Wi-Fi",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 3,
//           "service_type_id": 1,
//           "locale": "en",
//           "title": "Бесплатный Wi-Fi",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         }
//       ]
//     },
//     {
//       "id": 4,
//       "slug": "restaurant",
//       "created_at": "2024-06-24T10:22:38.000000Z",
//       "updated_at": "2024-06-24T10:22:38.000000Z",
//       "deleted_at": null,
//       "title": "Ресторан",
//       "pivot": {
//         "placement_id": 3,
//         "service_type_id": 4
//       },
//       "translations": [
//         {
//           "id": 10,
//           "service_type_id": 4,
//           "locale": "ru",
//           "title": "Ресторан",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 11,
//           "service_type_id": 4,
//           "locale": "kz",
//           "title": "Ресторан",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 12,
//           "service_type_id": 4,
//           "locale": "en",
//           "title": "Ресторан",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         }
//       ]
//     },
//     {
//       "id": 6,
//       "slug": "sauna",
//       "created_at": "2024-06-24T10:22:38.000000Z",
//       "updated_at": "2024-06-24T10:22:38.000000Z",
//       "deleted_at": null,
//       "title": "Сауна",
//       "pivot": {
//         "placement_id": 3,
//         "service_type_id": 6
//       },
//       "translations": [
//         {
//           "id": 16,
//           "service_type_id": 6,
//           "locale": "ru",
//           "title": "Сауна",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 17,
//           "service_type_id": 6,
//           "locale": "kz",
//           "title": "Сауна",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 18,
//           "service_type_id": 6,
//           "locale": "en",
//           "title": "Сауна",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         }
//       ]
//     },
//     {
//       "id": 7,
//       "slug": "24-hour-front-desk",
//       "created_at": "2024-06-24T10:22:38.000000Z",
//       "updated_at": "2024-06-24T10:22:38.000000Z",
//       "deleted_at": null,
//       "title": "Круглосуточная стойка регистрации",
//       "pivot": {
//         "placement_id": 3,
//         "service_type_id": 7
//       },
//       "translations": [
//         {
//           "id": 19,
//           "service_type_id": 7,
//           "locale": "ru",
//           "title": "Круглосуточная стойка регистрации",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 20,
//           "service_type_id": 7,
//           "locale": "kz",
//           "title": "Круглосуточная стойка регистрации",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 21,
//           "service_type_id": 7,
//           "locale": "en",
//           "title": "Круглосуточная стойка регистрации",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         }
//       ]
//     }
//   ],
//   "food_types": [
//     {
//       "id": 3,
//       "slug": "two-time",
//       "created_at": "2024-06-24T10:22:38.000000Z",
//       "updated_at": "2024-06-24T10:22:38.000000Z",
//       "deleted_at": null,
//       "title": "Двухразовое питание",
//       "pivot": {
//         "placement_id": 3,
//         "food_type_id": 3
//       },
//       "translations": [
//         {
//           "id": 9,
//           "food_type_id": 3,
//           "locale": "en",
//           "title": "Двухразовое питание",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 8,
//           "food_type_id": 3,
//           "locale": "kz",
//           "title": "Двухразовое питание",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         },
//         {
//           "id": 7,
//           "food_type_id": 3,
//           "locale": "ru",
//           "title": "Двухразовое питание",
//           "created_at": "2024-06-24T10:22:38.000000Z",
//           "updated_at": "2024-06-24T10:22:38.000000Z",
//           "deleted_at": null
//         }
//       ]
//     }
//   ],
//   "comforts": [],
//   "fines": []
// },
// "childrenCot": {
//   "id": 12,
//   "room_id": 3,
//   "quantity": 0,
//   "price": "0.00",
//   "deleted_at": null,
//   "created_at": "2024-06-27T07:31:32.000000Z",
//   "updated_at": "2024-06-27T07:31:32.000000Z"
// },
// "children": [
//   {
//     "id": 5,
//     "price": "0.00",
//     "range": "3-6",
//     "quantity": 0,
//     "room_id": 3
//   },
//   {
//     "id": 6,
//     "price": "0.00",
//     "range": "6-12",
//     "quantity": 0,
//     "room_id": 3
//   }
// ],
// "standartRoomTariffs": [
//   {
//     "id": 3,
//     "tariff_id": null,
//     "placement_id": 3,
//     "percent": "0.00",
//     "created_at": "2024-06-24T12:14:03.000000Z",
//     "updated_at": "2024-06-27T07:08:17.000000Z",
//     "deleted_at": null,
//     "title": "Стандарт",
//     "translations": [
//       {
//         "id": 7,
//         "tariff_id": 3,
//         "locale": "ru",
//         "title": "Стандарт",
//         "created_at": "2024-06-24T12:14:03.000000Z",
//         "updated_at": "2024-06-27T07:08:17.000000Z",
//         "deleted_at": null
//       },
//       {
//         "id": 8,
//         "tariff_id": 3,
//         "locale": "en",
//         "title": "Стандарт",
//         "created_at": "2024-06-24T12:14:03.000000Z",
//         "updated_at": "2024-06-27T07:08:17.000000Z",
//         "deleted_at": null
//       },
//       {
//         "id": 9,
//         "tariff_id": 3,
//         "locale": "kz",
//         "title": "Стандарт",
//         "created_at": "2024-06-24T12:14:03.000000Z",
//         "updated_at": "2024-06-27T07:08:17.000000Z",
//         "deleted_at": null
//       }
//     ],
//     "parent": null,
//     "room_tariffs": [
//       {
//         "id": 3,
//         "room_id": 3,
//         "tariff_id": 3,
//         "user_id": 6,
//         "status": "active",
//         "created_at": "2024-06-24T12:14:03.000000Z",
//         "updated_at": "2024-06-24T12:14:03.000000Z",
//         "deleted_at": null,
//         "prices": [
//           {
//             "id": 5,
//             "room_tariff_id": 3,
//             "price": "15000.00",
//             "from_at": "2025-12-02",
//             "until_at": "2025-12-06",
//             "created_at": "2024-06-26T05:17:55.000000Z",
//             "updated_at": "2024-06-26T05:17:55.000000Z",
//             "deleted_at": null
//           },
//           {
//             "id": 6,
//             "room_tariff_id": 3,
//             "price": "5.00",
//             "from_at": "2024-06-27",
//             "until_at": "2024-06-30",
//             "created_at": "2024-06-27T07:22:20.000000Z",
//             "updated_at": "2024-06-27T07:22:20.000000Z",
//             "deleted_at": null
//           },
//           {
//             "id": 7,
//             "room_tariff_id": 3,
//             "price": "100.00",
//             "from_at": "2024-07-01",
//             "until_at": "2024-07-03",
//             "created_at": "2024-06-27T07:29:11.000000Z",
//             "updated_at": "2024-06-27T07:29:11.000000Z",
//             "deleted_at": null
//           },
//           {
//             "id": 8,
//             "room_tariff_id": 3,
//             "price": "5.00",
//             "from_at": "2024-07-01",
//             "until_at": "2024-07-06",
//             "created_at": "2024-06-27T07:32:41.000000Z",
//             "updated_at": "2024-06-27T07:32:41.000000Z",
//             "deleted_at": null
//           }
//         ],
//         "quantities": [
//           {
//             "id": 5,
//             "room_tariff_id": 3,
//             "quantity": 20,
//             "from_at": "2025-12-02",
//             "until_at": "2025-12-06",
//             "created_at": "2024-06-26T05:17:55.000000Z",
//             "updated_at": "2024-06-26T05:17:55.000000Z",
//             "deleted_at": null
//           },
//           {
//             "id": 6,
//             "room_tariff_id": 3,
//             "quantity": 5,
//             "from_at": "2024-06-27",
//             "until_at": "2024-06-30",
//             "created_at": "2024-06-27T07:22:20.000000Z",
//             "updated_at": "2024-06-27T07:22:20.000000Z",
//             "deleted_at": null
//           },
//           {
//             "id": 7,
//             "room_tariff_id": 3,
//             "quantity": 10,
//             "from_at": "2024-07-01",
//             "until_at": "2024-07-03",
//             "created_at": "2024-06-27T07:29:11.000000Z",
//             "updated_at": "2024-06-27T07:29:11.000000Z",
//             "deleted_at": null
//           },
//           {
//             "id": 8,
//             "room_tariff_id": 3,
//             "quantity": 10,
//             "from_at": "2024-07-01",
//             "until_at": "2024-07-06",
//             "created_at": "2024-06-27T07:32:41.000000Z",
//             "updated_at": "2024-06-27T07:32:41.000000Z",
//             "deleted_at": null
//           }
//         ],
//         "statuses": [
//           {
//             "id": 3,
//             "room_tariff_id": 3,
//             "status": "active",
//             "from_at": "2024-06-27",
//             "until_at": "2024-06-30",
//             "created_at": "2024-06-27T07:22:20.000000Z",
//             "updated_at": "2024-06-27T07:22:20.000000Z",
//             "deleted_at": null
//           },
//           {
//             "id": 4,
//             "room_tariff_id": 3,
//             "status": "active",
//             "from_at": "2024-07-01",
//             "until_at": "2024-07-03",
//             "created_at": "2024-06-27T07:29:11.000000Z",
//             "updated_at": "2024-06-27T07:29:11.000000Z",
//             "deleted_at": null
//           },
//           {
//             "id": 5,
//             "room_tariff_id": 3,
//             "status": "active",
//             "from_at": "2024-07-01",
//             "until_at": "2024-07-06",
//             "created_at": "2024-06-27T07:32:41.000000Z",
//             "updated_at": "2024-06-27T07:32:41.000000Z",
//             "deleted_at": null
//           }
//         ]
//       }
//     ],
//     "children": []
//   }
// ]
// }

import { IComfortType, IFoodType } from "./AdditionalTypes";

interface IGalleryImage {
  id: number;
  name: string;
  path: string;
  size: number;
  hash: string;
  created_at: string;
}

interface IRoomType {
  id: number;
  slug: string;
  number_room: number;
  sleeping_places: number;
  title: string;
  description: string;
  created_at: string;
}

interface IRoomSettlement {
  id: number;
  room_id: number;
  fine: string;
  check_in: string;
  check_out: string;
  cancellation: {
    id: number;
    time: string;
  };
}

interface IRoomTariff {
  id: number;
  room_id: number;
  tariff_id: number;
  user_id: number;
  status: string;
  created_at: string;
  updated_at: string;
  deleted_at: string;
  prices: {
    id: number;
    room_tariff_id: number;
    price: string;
    from_at: string;
    until_at: string;
    created_at: string;
    updated_at: string;
    deleted_at: string;
  }[];
  quantities: {
    id: number;
    room_tariff_id: number;
    quantity: number;
    from_at: string;
    until_at: string;
    created_at: string;
    updated_at: string;
    deleted_at: string;
  }[];
  statuses: any[];
}

interface IRoomChildrenCot {
  id: number;
  room_id: number;
  quantity: number;
  price: string;
  deleted_at: string;
  created_at: string;
  updated_at: string;
}

interface IRoomChildrenSpecial {
  id: number;
  price: string;
  range: string;
  quantity: number;
  room_id: number;
}

interface IRoom {
  id: number;
  room_type: IRoomType;
  title: string;
  description: string;
  default_price: string;
  default_quantity: number;
  price: string;
  tariff_id: number;
  square: number;
  smoking: number;
  room_settlement: IRoomSettlement;
  gallery_images: IGalleryImage[];
  comfort_rooms: IComfortType[];
  food_types: IFoodType[];
  best_tariff: any;
  min_booking_period: number;
  roomTariffs: IRoomTariff[];
  placement: any;
  childrenCot: IRoomChildrenCot;
  children: IRoomChildrenSpecial[];
}

export type {
  IRoomType,
  IRoomSettlement,
  IRoomTariff,
  IRoomChildrenCot,
  IRoomChildrenSpecial,
  IRoom,
};
